#------------------------------------------------------------------------
# 참조 모듈 목록.
#------------------------------------------------------------------------
from .pyson_helper import PYSONHelper
import json


#------------------------------------------------------------------------
# 오브젝트.
#------------------------------------------------------------------------
class PYSONObject:
	#------------------------------------------------------------------------
	# 생성됨.
	#------------------------------------------------------------------------
	def __init__(self) -> None:
		self.__pyson_text__ : str = None
		self.__pyson_object__ : object = None

	#------------------------------------------------------------------------
	# 파일에서 불러오기.
	#------------------------------------------------------------------------
	def LoadFromFile(self, pysonFilePath : str) -> None:
		pass

	#------------------------------------------------------------------------
	# 파일로 저장하기.
	#------------------------------------------------------------------------
	def SaveToFile(self, pysonFilePath : str) -> None:
		pass

	#------------------------------------------------------------------------
	# 문자열에서 불러오기.
	#------------------------------------------------------------------------
	def LoadFromString(self, pysonString : str) -> None:
		self.__pyson_text__ = PYSONHelper.RemoveAllCommentsInString(pysonString)
		self.__pyson_object__ = json.loads(self.__pyson_text__)

	#------------------------------------------------------------------------
	# 문자열로 저장하기.
	#------------------------------------------------------------------------
	def SaveToString(self) -> str:
		pysonString : str = repr(self.__pyson_object__)
		return pysonString
	

	#------------------------------------------------------------------------
	# 직렬화.
	#------------------------------------------------------------------------
	@staticmethod
	def Serialize(classObject : object) -> str:
		pysonString : str = json.dump()
		return pysonString


	#------------------------------------------------------------------------
	# 역직렬화.
	#------------------------------------------------------------------------
	@staticmethod
	def Deserialize(pysonString : str) -> object:
		pysonString = PYSONHelper.RemoveAllCommentsInString(pysonString)
		classObject : object = None
		return classObject